Documents/ЗаявкаПайщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаявкаПайщика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоПрочимАктивам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявокПайщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиАнкетИЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПайщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПайщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминальныеДержатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаДепоВладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНаСчетеДепоВладельца</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрытьЗакрытьДепозитарныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданДокументом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственностьНаПаи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Многократная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЭП_НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЭП_Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЭП_ДатаВремяПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФондДляОбменаПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрытьДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВЛице</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПолномочий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПолномочийВЛице</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Имущество</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидИмущества</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имущество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗадолженностиПоПрочимАктивам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоПрочимАктивам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИмущества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Имущество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ОценкиСтоимостиПрочихАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОценкиСтоимостиПрочихАктивов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтадияОбесценения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадииОбесценения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Оценщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОценки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОценки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеСтоимостиАктивов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыЗаявокНаПриобретениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаявокНаПриобретениеПаев</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокПайщиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаПайщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаПайщика/Ext/ObjectModule.bsl
Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	Движения.ЗадолженностиПоПрочимАктивам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкаПайщикаИмущество.Ссылка.Дата КАК Период,
		|	ЗаявкаПайщикаИмущество.Ссылка.Организация КАК Организация,
		|	&СчетДУ КАК СчетДоверительногоУправления,
		|	ЗаявкаПайщикаИмущество.ВидИмущества КАК ВидИмущества,
		|	ЗаявкаПайщикаИмущество.Имущество КАК Имущество,
		|	ЗаявкаПайщикаИмущество.Имущество.Представление КАК ИмуществоПредставление,
		|	ЗаявкаПайщикаИмущество.Ссылка КАК Основание,
		|	СУММА(ЗаявкаПайщикаИмущество.Количество) КАК Количество,
		|	СУММА(ЗаявкаПайщикаИмущество.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ЗаявкаПайщика.Имущество КАК ЗаявкаПайщикаИмущество
		|ГДЕ
		|	ЗаявкаПайщикаИмущество.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаПайщикаИмущество.Ссылка.Организация,
		|	ЗаявкаПайщикаИмущество.Имущество,
		|	ЗаявкаПайщикаИмущество.ВидИмущества,
		|	ЗаявкаПайщикаИмущество.Ссылка.Дата,
		|	ЗаявкаПайщикаИмущество.Имущество.Представление,
		|	ЗаявкаПайщикаИмущество.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СчетДУ", Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ЭтотОбъект.ПаевойИнвестиционныйФонд));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ЗадолженностиПоПрочимАктивам.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНомерЗаявкиПоНомеру()
	
	МассивСтрок = СтрРазделить(Номер, "-");
	
	//Если МассивСтрок.Количество() <> 5 Тогда
	//	ВызватьИсключение "Системный номер """ + Номер + """ не соответствует ожидаемому [Префикс организации]-[Прификс вида (0 или 1)]-[Код ПИФ]-[Код места]-[Порядковый номер]";
	//КонецЕсли;
	
	Если ИсточникЗаявки = Перечисления.ИсточникиАнкетИЗаявок.Офис Тогда
		НомерЗаявки = РаботаСоСтрокамиКлиентСервер.СократитьЛидирующиеНули(МассивСтрок[4]);
	Иначе     
		
		НомерЗаявки = Номер;
		
		//НомерЗаявки = МассивСтрок[2];
		//
		//Если МассивСтрок[3] = "000ON" Тогда
		//	НомерЗаявки = НомерЗаявки + "-" + "ON";
		//Иначе
		//	НомерЗаявки = НомерЗаявки + "-" + МассивСтрок[3];
		//КонецЕсли;
		//
		//НомерЗаявки = НомерЗаявки + "-" + РаботаСоСтрокамиКлиентСервер.СократитьЛидирующиеНули(МассивСтрок[4]);
		
	КонецЕсли;
	
	НомерЗаявки = НомерЗаявки;
	
КонецПроцедуры

Процедура ЗаполнитьНомерПоНомеруЗаявки()
	
	МассивСтрок = СтрРазделить(НомерЗаявки, "-");
	
	ПрефиксНумерации = Организация.ПрефиксНумерации;
	
	Если ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Зачисление Тогда
		КодВида = "-0";
	Иначе
		КодВида = "-1";
	КонецЕсли;
	
	Если МассивСтрок.Количество() = 1 Тогда
		Номер = ПрефиксНумерации + КодВида 
			+ "-" + РаботаСоСтрокамиКлиентСервер.ДополнитьСтроку(РаботаСоСтрокамиКлиентСервер.СократитьЛидирующиеНули(ПаевойИнвестиционныйФонд.Код), 2)
			+ "-00000"
			+ "-" + РаботаСоСтрокамиКлиентСервер.ДополнитьСтроку(МассивСтрок[0],7);
	ИначеЕсли МассивСтрок.Количество() = 3 Тогда
		Номер = ПрефиксНумерации + КодВида 
			+ "-" + РаботаСоСтрокамиКлиентСервер.ДополнитьСтроку(МассивСтрок[0],2)
			+ "-" + РаботаСоСтрокамиКлиентСервер.ДополнитьСтроку(МассивСтрок[1],5)
			+ "-" + РаботаСоСтрокамиКлиентСервер.ДополнитьСтроку(МассивСтрок[2],7);
	Иначе
		ВызватьИсключение "Номер заявки """ + НомерЗаявки + """ не соответствует одному из шаблонов [Код ПИФ]-[Код места]-[Порядковый номер] или [Порядковый номер]";
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьНеиспользуемыеРеквизитыЗаявки()
	
	Если ЗначениеЗаполнено(НоминальныеДержатели)
		и ВидПайщика <> Перечисления.ВидыПайщиков.НоминальныйДержатель Тогда
		НоминальныеДержатели = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Агент)
		и ИсточникЗаявки <> Перечисления.ИсточникиАнкетИЗаявок.Агент Тогда
		Агент = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьПаиПайщикаДляобмена()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток < &Количество КАК НеХватаетПаевВФонде
		|ИЗ
		|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд
		|				И Пайщик = &Пайщик) КАК ДолиПайщиковВИнвестиционномФондеОстатки");
	
	Запрос.УстановитьПараметр("Организация",						ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период",								Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд",			ЭтотОбъект.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("Пайщик",								ЭтотОбъект.Пайщик);
	Запрос.УстановитьПараметр("Количество",							ЭтотОбъект.Количество);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	ТекстОшибки = "";
	Если Выборка.Следующий() Тогда
		Если Выборка.НеХватаетПаевВФонде Тогда
			ТекстОшибки = СтрШаблон("Количество паев в заявке превышает количество в наличии %1 у пайщика %2 (%3)",
				Выборка.КоличествоОстаток,
				ЭтотОбъект.Пайщик,
				ЭтотОбъект.ПаевойИнвестиционныйФонд);
		КонецЕсли;
	Иначе
		ТекстОшибки = СтрШаблон("У пайщика %1 отсутствуют паи в %2", ЭтотОбъект.Пайщик, ЭтотОбъект.ПаевойИнвестиционныйФонд);
	КонецЕсли;	
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		Возврат Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Если ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Зачисление Тогда
		КодВида = "-0";
	Иначе
		КодВида = "-1";
	КонецЕсли;
	
	Если ИсточникЗаявки = Перечисления.ИсточникиАнкетИЗаявок.Офис Тогда
		КодМеста = "-00000";
	Иначе
		Если ИсточникЗаявки = Перечисления.ИсточникиАнкетИЗаявок.Сайт Тогда
			КодМеста = "-000ON";	
		Иначе
			КодМеста = "-99999";
		КонецЕсли;
	КонецЕсли;
	КодПИФ = "-" + РаботаСоСтрокамиКлиентСервер.ДополнитьСтроку(РаботаСоСтрокамиКлиентСервер.СократитьЛидирующиеНули(ПаевойИнвестиционныйФонд.Код),2);
	
	Префикс = Организация.ПрефиксНумерации + КодВида + КодПИФ + КодМеста + "-";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Организация = ПараметрыСеанса.ТекущаяОрганизация;
		
		ДанныеЗаполнения.Свойство("Пайщик", Пайщик);
		ДанныеЗаполнения.Свойство("ПаевойИнвестиционныйФонд", ПаевойИнвестиционныйФонд);
		
		Владелец = Пайщик;
		
		Если Пайщик.ЭтоГруппа Тогда
			ВызватьИсключение "Заявка пайщика не вводится для группы клиентов!";
		КонецЕсли;
		
		РеквизитыПлатежа = Справочники.БанковскиеСчета.ПолучитьРеквизитыПлатежа(Организация, Владелец, , ТекущаяДатаСеанса());
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыПлатежа);
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключение реквизитов
	МассивИсключаемыхРеквизитов = Новый Массив;
	
	Если ИсточникЗаявки <> Перечисления.ИсточникиАнкетИЗаявок.Агент Тогда
		МассивИсключаемыхРеквизитов.Добавить("Агент");	
		МассивИсключаемыхРеквизитов.Добавить("ПодразделениеАгента");	
	КонецЕсли;
	
	Если ВидПайщика <> Перечисления.ВидыПайщиков.НоминальныйДержатель Тогда
		МассивИсключаемыхРеквизитов.Добавить("Брокер");	
	КонецЕсли;
	
	Если ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Зачисление Тогда
		
		МассивИсключаемыхРеквизитов.Добавить("Количество");
		
	КонецЕсли;	
	
		
	Для каждого НеПроверяемыйРеквизит из МассивИсключаемыхРеквизитов Цикл
		
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти(НеПроверяемыйРеквизит);
		Если ИндексЭлемента <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);	
		КонецЕсли;
		
	КонецЦикла;
	
	УКПИ = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ");
	
	// Добавление реквизитов
	Если ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Зачисление Тогда
		
		Если Не Многократная Тогда
			
			Если ЭтотОбъект.Имущество.Количество() = 0 Тогда
				ПроверяемыеРеквизиты.Добавить("Сумма");	
			КонецЕсли;
			
		КонецЕсли;
		Если Не ОткрытьЗакрытьДепозитарныйСчет Тогда
			ПроверяемыеРеквизиты.Добавить("ДепозитарныйСчет");	
		КонецЕсли;
	Иначе
		Если ЭтотОбъект.Организация <> УКПИ или ЭтотОбъект.Дата > Дата(2020,1,1) Тогда
			ПроверяемыеРеквизиты.Добавить("ДепозитарныйСчет");	
		КонецЕсли;
	КонецЕсли;
	
	Если Пайщик.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо
		и ВидПайщика = Перечисления.ВидыПайщиков.Владелец
		и Представители.Количество() = 0 Тогда
		
	        Если ЭтотОбъект.Организация <> УКПИ или ЭтотОбъект.Дата > Дата(2020,1,1) Тогда
				СтрокаСообщения = "Для юридических лиц необходимо указание уполномоченных представителей";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, Ссылка, "Пайщик", "Объект", Отказ);
			КонецЕсли;
			
	КонецЕсли;
	
	Если ЭтотОбъект.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Обмен Тогда
		
		ПроверяемыеРеквизиты.Добавить("ПаевойИнвестиционныйФондДляОбменаПаев");
		
		Если Не ЭтотОбъект.ОткрытьДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена Тогда
			ПроверяемыеРеквизиты.Добавить("ДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена");
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого СтрокаПредставитель из Представители Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаПредставитель.Представитель) Тогда
			
			СтрокаСообщения = "Не указан представитель пайщика " + СтрокаПредставитель.НомерСтроки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, Ссылка, "Представители[" + Формат(СтрокаПредставитель.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Представитель", "Объект", Отказ);
			
		Иначе
			
			Если СтрокаПредставитель.Представитель.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо
				и Не ЗначениеЗаполнено(СтрокаПредставитель.ВЛице) Тогда
				
				СтрокаСообщения = "Не указано лицо представителя пайщика " + СтрокаПредставитель.НомерСтроки + " """ + СтрокаПредставитель.Представитель + """";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, Ссылка, "Представители[" + Формат(СтрокаПредставитель.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ВЛице", "Объект", Отказ);
				
			КонецЕсли; 
				
		КонецЕсли;
		
	КонецЦикла;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// Очистка реквизитов
	ОчиститьНеиспользуемыеРеквизитыЗаявки();
	
	// Нумерация документов
	Если ПустаяСтрока(Номер) Тогда
		
		Если Не ПустаяСтрока(НомерЗаявки) Тогда
			ЗаполнитьНомерПоНомеруЗаявки();
		Иначе
			УстановитьНовыйНомер();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПустаяСтрока(НомерЗаявки) Тогда
		ЗаполнитьНомерЗаявкиПоНомеру();	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерСчета) Тогда
		
		Справочники.БанковскиеСчета.СоздатьПолучитьРасчетныйСчет(
			ЭтотОбъект.РасчетныйСчет, 
			ЭтотОбъект.Организация, 
			ЭтотОбъект.БИК, 
			ЭтотОбъект.НомерСчета, 
			ЭтотОбъект.Владелец, 
			ЗначениеЗаполнено(ЭтотОбъект.ЛицевойСчет), 
			ЭтотОбъект.ВидПайщика = Перечисления.ВидыПайщиков.Владелец, 
			Отказ);
		
	Иначе
		Если Не ОбменДанными.Загрузка Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны реквизиты вывода денежных средств", Ссылка, "РасчетныйСчет", "Объект", );
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Обмен Тогда
		// В ПИФе у пайщика должны быть паи
		Отказ = Не ПроверитьПаиПайщикаДляобмена();
	КонецЕсли;

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТаблицаИмущества.Имущество КАК Имущество,
			|	_ТаблицаИмущества.ВидИмущества КАК ВидИмущества,
			|	_ТаблицаИмущества.НомерСтроки КАК НомерСтроки,
			|	_ТаблицаИмущества.Сумма КАК Сумма
			|ПОМЕСТИТЬ _ПоДокументу0
			|ИЗ
			|	&ТаблицаИмущества КАК _ТаблицаИмущества
			|ГДЕ
			|	_ТаблицаИмущества.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПоДокументу0.Имущество КАК Имущество,
			|	МИНИМУМ(_ПоДокументу0.НомерСтроки) КАК НомерСтроки,
			|	МИНИМУМ(_ПоДокументу0.Сумма) КАК Сумма,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПоДокументу0.НомерСтроки) КАК КоличествоСтрок,
			|	_ПоДокументу0.ВидИмущества КАК ВидИмущества
			|ПОМЕСТИТЬ _ПоДокументу
			|ИЗ
			|	_ПоДокументу0 КАК _ПоДокументу0
			|
			|СГРУППИРОВАТЬ ПО
			|	_ПоДокументу0.Имущество,
			|	_ПоДокументу0.ВидИмущества
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОбъектыНедвижимости.Представление КАК Представление,
			|	_ПоДокументу.НомерСтроки КАК НомерСтроки,
			|	_ПоДокументу.Сумма КАК Сумма,
			|	ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость КАК Стоимость,
			|	ОценкиСтоимостиПрочихАктивовСрезПоследних.СубъектАналитики ЕСТЬ NULL КАК НетСтоимостиОценщика,
			|	ВЫБОР
			|		КОГДА ОбъектыНедвижимости.ВидОбъектаНедвижимости = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНедвижимости.Помещение)
			|				И РеквизитыОбъектовНедвижимостиСрезПоследних.НазначениеОбъектаНедвижимости = ЕСТЬNULL(&НежилоеПомещение, 0)
			|			ТОГДА _ПоДокументу.Сумма < ЕСТЬNULL(ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость, 0)
			|		ИНАЧЕ _ПоДокументу.Сумма <> ЕСТЬNULL(ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость, 0)
			|	КОНЕЦ КАК СтоимостьОценщикаОтличается,
			|	_ПоДокументу.КоличествоСтрок > 1
			|		И _ПоДокументу.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость) КАК КоличествоБольшеОдного
			|ИЗ
			|	_ПоДокументу КАК _ПоДокументу
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
			|		ПО _ПоДокументу.Имущество = ОбъектыНедвижимости.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостиПрочихАктивов.СрезПоследних(
			|				&ДатаДокумента,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость)) КАК ОценкиСтоимостиПрочихАктивовСрезПоследних
			|		ПО _ПоДокументу.Имущество = ОценкиСтоимостиПрочихАктивовСрезПоследних.СубъектАналитики
			|			И (ОценкиСтоимостиПрочихАктивовСрезПоследних.ДатаОкончанияДействия >= &ДатаДокумента),
			|	РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
			|			&ДатаДокумента,
			|			ОбъектНедвижимости В
			|				(ВЫБРАТЬ
			|					_ПоДокументу.Имущество КАК Имущество
			|				ИЗ
			|					_ПоДокументу КАК _ПоДокументу)) КАК РеквизитыОбъектовНедвижимостиСрезПоследних
			|ГДЕ
			|	(ОценкиСтоимостиПрочихАктивовСрезПоследних.СубъектАналитики ЕСТЬ NULL
			|			ИЛИ _ПоДокументу.Сумма <> ЕСТЬNULL(ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость, 0)
			|			ИЛИ _ПоДокументу.КоличествоСтрок > 1
			|				И _ПоДокументу.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость))";
		
		Запрос.УстановитьПараметр("ДатаДокумента", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ЭтотОбъект.ПаевойИнвестиционныйФонд));
		Запрос.УстановитьПараметр("ТаблицаИмущества", ЭтотОбъект.Имущество.Выгрузить());
		Запрос.УстановитьПараметр("НежилоеПомещение", ОбщегоНазначенияПовтИсп.ПолучитьИменованныйОбъект("НазначениеНедвижимости_НежилоеПомещение"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.НетСтоимостиОценщика Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта недвижимости """ + ВыборкаДетальныеЗаписи.Представление 
					+ """ не определена стоимость оценщика", ЭтотОбъект, "Имущество[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Имущество",, Отказ);
			ИначеЕсли ВыборкаДетальныеЗаписи.СтоимостьОценщикаОтличается Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта недвижимости """ + ВыборкаДетальныеЗаписи.Представление 
					+ """ указана другая стоимость оценщика ("+ВыборкаДетальныеЗаписи.Стоимость+")", 
					ЭтотОбъект, "Имущество[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Сумма",, Отказ);
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.КоличествоБольшеОдного Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект имушества """ + ВыборкаДетальныеЗаписи.Представление 
					+ """ включен в заявку более одного раза", ЭтотОбъект, "Имущество["+(ВыборкаДетальныеЗаписи.НомерСтроки - 1)+"].Имущество",,Отказ);
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.НомерЗаявки = Неопределено;
	
	ЭтотОбъект.ПЭП_ДатаВремяПодписи	= "";
	ЭтотОбъект.ПЭП_Код				= "";
	ЭтотОбъект.ПЭП_НомерТелефона	= "";
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый И ЭтотОбъект.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Зачисление Тогда
		
		РегистрыСведений.СтатусыЗаявокНаПриобретениеПаев.УстановитьСтатусЗаявкиНаПриобретениеПаев(
								ЭтотОбъект.Организация,
								ЭтотОбъект.Ссылка,
								Перечисления.СтатусыЗаявокПайщиков.НаПроверке,
								ЭтотОбъект.Дата,
								Отказ);
								
	КонецЕсли;
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
